---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementShowPlanes
source: html/99107bc7-f907-42a9-a15e-9d6ad4c875e2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementShowPlanes Property

"Show Reference Planes"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementShowPlanes { get; }
```